package OOP;


import java.util.Arrays;

import java.util.Scanner;



/*   

*  문제> 제품번호(code), 제품이름(name), 제품색상(color), 제품수량(su), 제품가격(price)이 존재합니다.

*  setter()라는 메소드를 이용하여 데이터를 저장하고

*  getter()라는 메소드를 이용하여 데이터를 출력하세요.

*  --------------------------------------------

*   제품번호(code) :

* 	 제품이름(name) : 

*   제품색상(color) :

*   제품수량(su) :

* 	 제품가격(price) :

*  --------------------------------------------

*  제품 판매액 :  원

*  --------------------------------------------  

*/

/*  1. 파일 이름을 이용해서 객체를 만든다.
*  2. 객체 위에 입력받는 값을 만든다.
*  3. 객체 변수명. ~~호출명을 정해준다.
*  4. 호출명 괄호()안에 전달인자값을 넣어준다.
*  5. 생성자를 만든다.
*  6. 각 생성자 안에 this.전달인자값을 만들어준다.
*  7. 출력해본다.

*   

* 

*/
     public class OOPsample1_16_getset1_401_practice {

	
                   public static void main(String[] args) {
                	  
	

	

 

                   }

} // class end
